Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: Population setup is restricted by primary owner access
th_th: การตั้งค่าประชากรถูกจำกัดโดยสิทธิ์การเข้าถึงของเจ้าของหลัก

source: Population setup is restricted by local admin access.
th_th: การตั้งค่าประชากรถูกจำกัดโดยการเข้าถึงของผู้ดูแลระบบในพื้นที่

source: Privacy settings
th_th: การตั้งค่าความเป็นส่วนตัว

source: Configure the privacy settings
th_th: กำหนดค่าการตั้งค่าความเป็นส่วนตัว

source: Mandatory question
th_th: คำถามที่จำเป็น

source: Checkboxes
th_th: กล่องกาเครื่องหมาย

source: Radio buttons
th_th: ปุ่มตัวเลือกแบบวิทยุ

source: Text input
th_th: การป้อนข้อความ

source: Edit question
th_th: แก้ไขคำถาม

source: No questions yet
th_th: ยังไม่มีคำถาม

source: Answer to this question is mandatory.
th_th: จำเป็นต้องตอบคำถามนี้

source: Response permission
th_th: สิทธิ์การตอบกลับ

source: Manager only
th_th: สำหรับผู้จัดการเท่านั้น

source: Worker only
th_th: เฉพาะพนักงาน

source: Worker & manager
th_th: พนักงานและผู้จัดการ

source: Career plan questionnaire
th_th: แบบสอบถามแผนอาชีพ

source: Add answer option
th_th: เพิ่มตัวเลือกคำตอบ

source: The answer option cannot be empty.
th_th: ตัวเลือกคำตอบต้องไม่เว้นว่าง

source: Create questions for workers
th_th: สร้างคำถามสำหรับพนักงาน

source: Languages: {{numerator}}/{{denominator}}
th_th: ภาษา: {{numerator}}/{{denominator}}

source: List of answer options
th_th: รายการตัวเลือกคำตอบ

source: At least {{count}} answer option is required for this answer type
th_th: ต้องมีตัวเลือกคำตอบอย่างน้อย {{count}} ตัวเลือกสำหรับประเภทคำตอบนี้

source: At least {{count}} answer options are required for this answer type
th_th: ต้องมีตัวเลือกคำตอบอย่างน้อย {{count}} ตัวเลือกสำหรับประเภทคำตอบนี้

source: Please provide a question.
th_th: โปรดระบุคำถาม

source: Show disabled
th_th: แสดงรายการที่เปิดใช้งาน

source: Response rule
th_th: กฎการตอบกลับ

source: Skill library
th_th: ไลบรารีทักษะ

source: Configure the skill set for the plan
th_th: กำหนดค่าชุดทักษะสำหรับแผน

source: Sidebar widgets
th_th: วิดเจ็ตแถบด้านข้าง

source: Enable, set up & reorder sidebar widgets
th_th: เปิดใช้งาน ตั้งค่า และเรียงลำดับวิดเจ็ตแถบด้านข้างใหม่

source: Workflow
th_th: เวิร์กโฟลว์

source: Update the workflow labels
th_th: อัปเดตป้ายกำกับเวิร์กโฟลว์

source: Change display name
th_th: เปลี่ยนชื่อที่แสดง

source: Selected workflow step
th_th: ขั้นตอนเวิร์กโฟลว์ที่เลือก

source: Receive insights and guidance from your manager.
th_th: รับข้อมูลเชิงลึกและคำแนะนำจากหัวหน้างานของคุณ

source: Manager feedback
th_th: ฟีดแบคของหัวหน้างาน

source: Reflect on your achievements and growth areas.
th_th: สะท้อนถึงความสำเร็จและพื้นที่การเติบโตของคุณ

source: The manager can still fill in certain fields and, after performing the action, submit the form.
th_th: ผู้จัดการยังสามารถกรอกข้อมูลในบางช่องได้ และหลังจากดำเนินการแล้ว สามารถส่งแบบฟอร์มได้

source: Allow workers to refuse the career development
th_th: อนุญาตให้พนักงานปฏิเสธการพัฒนาสายอาชีพ

source: Create career development plan
th_th: สร้างแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: View & manage career development plans
th_th: ดูและจัดการแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Development plans
th_th: แผนพัฒนาการ

source: End date: {{date}}
th_th: วันที่สิ้นสุด: {{date}}

source: Start date: {{date}}
th_th: วันที่เริ่มต้น: {{date}}

source: No careers plans. Check again soon for updates and new opportunities to support your professional growth. We’re here to help you achieve your career goals.
th_th: ไม่มีแผนอาชีพ โปรดติดตามข่าวสารและโอกาสใหม่ๆ ที่จะสนับสนุนการเติบโตในอาชีพของคุณอีกครั้งในเร็วๆ นี้ เราพร้อมช่วยให้คุณบรรลุเป้าหมายด้านอาชีพของคุณ

source: No career development plans
th_th: ไม่มีแผนพัฒนาอาชีพ

source: The file was successfully uploaded. Please download the log file to review any errors. Focus on the last two columns, “Result” and “Error Description,” for details on any issues encountered.
th_th: ไฟล์ถูกอัปโหลดเรียบร้อยแล้ว กรุณาดาวน์โหลดไฟล์บันทึกเพื่อตรวจสอบข้อผิดพลาดใด ๆ ให้เน้นที่สองคอลัมน์สุดท้าย คือ “ผลลัพธ์” และ “คำอธิบายข้อผิดพลาด” เพื่อดูรายละเอียดเกี่ยวกับปัญหาที่พบ

source: Are you sure you want to delete the career development plan?
th_th: คุณแน่ใจหรือว่าต้องการลบแผนพัฒนาสายอาชีพนี้?

source: Delete career development plan
th_th: ลบแผนพัฒนาสายอาชีพ

source: The career development plan template was successfully deleted.
th_th: ลบเทมเพลนแผนพัฒนาสายอาชีพเรียบร้อยแล้ว

source: The career development plan was duplicated and a new item was created.
th_th: แผนพัฒนาสายอาชีพถูกทำซ้ำและมีการสร้างรายการใหม่ขึ้นมา

source: No career development plans yet!
th_th: ยังไม่มีแผนพัฒนาสายอาชีพในขณะนี้!

source: Open career development plan
th_th: เปิดแผนพัฒนาสายอาชีพ

source: Career development plans
th_th: แผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Upload skills
th_th: อัปโหลดทักษะ

source: Download career development plan
th_th: ดาวน์โหลดแผนพัฒนาสายอาชีพ

source: Generate PDF
th_th: สร้าง PDF

source: Send to Documents
th_th: ส่งไปยังเอกสาร

source: Preview behavior wheel widget
th_th: ดูตัวอย่างวิดเจ็ตวงล้อพฤติกรรม

source: Behavior wheel
th_th: วงล้อพฤติกรรม

source: Enable chat messages for the entire duration of the career development plan.
th_th: เปิดใช้งานข้อความแชทตลอดระยะเวลาแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Career chat
th_th: แชทเรื่องอาชีพ

source: Add resources
th_th: เพิ่มทรัพยากร

source: Provide links to workers and managers
th_th: ระบุลิงก์ไปยังพนักงานและหัวหน้างาน

source: Go to edit mode to get started by creating one.
th_th: ไปที่โหมดแก้ไขเพื่อเริ่มต้นโดยการสร้างรายการหนึ่งรายการ

source: No resources added yet!
th_th: ยังไม่มีการเพิ่มทรัพยากร!

source: Label
th_th: ป้ายกำกับ

source: Link
th_th: ลิงก์

source: Invalid URL. Make sure you enter a URL that uses the HTTPS protocol.
th_th: URL ไม่ถูกต้อง กรุณาตรวจสอบให้แน่ใจว่าคุณป้อน URL ที่ใช้โปรโตคอล HTTPS

source: Resource list
th_th: รายการทรัพยากร

source: Resources
th_th: ทรัพยากร

source: Skills & competency groups
th_th: กลุ่มทักษะและความสามารถ

source: You must select at least one skill.
th_th: คุณจะต้องเลือกอย่างน้อยหนึ่งทักษะ

source: Skill Libraries
th_th: ไลบรารีทักษะ

source: The size of the file exceeds the maximum limit.
th_th: ขนาดไฟล์เกินขีดจำกัดสูงสุด

source: Upload file
th_th: อัปโหลดไฟล์

source: Upload the CSV file (Max: 1MB). Ensure the file is correctly formatted for a seamless upload.
th_th: อัปโหลดไฟล์ CSV (สูงสุด: 1MB) ตรวจสอบให้แน่ใจว่าไฟล์ได้รับการจัดรูปแบบอย่างถูกต้องเพื่อให้อัปโหลดได้อย่างราบรื่น

source: Import file
th_th: นำเข้าไฟล์

source: Download your current skill configuration
th_th: ดาวน์โหลดการกำหนดค่าทักษะปัจจุบันของคุณ

source: Upload the modified file
th_th: อัปโหลดไฟล์ที่แก้ไขแล้ว

source: Add new skills to the file or update the existing skills
th_th: เพิ่มทักษะใหม่ลงในไฟล์หรืออัปเดตทักษะที่มีอยู่

source: Add skills to the library
th_th: เพิ่มทักษะให้กับไลบรารี

source: This operation might take a few minutes; please keep this window open.
th_th: การดำเนินการนี้อาจใช้เวลาสองสามนาที โปรดเปิดหน้าต่างนี้เอาไว้

source: Processing
th_th: กำลังประมวลผล

source: Parent element
th_th: องค์ประกอบหลัก

source: This code already exists.
th_th: รหัสนี้มีอยู่แล้ว

source: Create comp element
th_th: สร้างองค์ประกอบของผลตอบแทน

source: Edit comp element
th_th: แก้ไของค์ประกอบผลตอบแทน

source: Element code
th_th: รหัสองค์ประกอบ

source: The code will be automatically generated after creation.
th_th: รหัสจะถูกสร้างขึ้นโดยอัตโนมัติหลังจากการสร้าง

source: Customer code
th_th: รหัสลูกค้า

source: The customer code cannot be empty.
th_th: รหัสลูกค้าไม่สามารถเว้นว่างได้

source: Use this for mapping purpose
th_th: ใช้สิ่งนี้เพื่อจุดประสงค์ในการทำแผนที่

source: Element type
th_th: ประเภทองค์ประกอบ

source: Comp elements
th_th: องค์ประกอบผลตอบแทน

source: Comp elements in use
th_th: องค์ประกอบผลตอบแทนที่ใช้

source: Comp groups
th_th: กลุ่มผลตอบแทน

source: Comp trees
th_th: แผนภูมิผลตอบแทน

source: View rounds using comp elements
th_th: ดูรอบโดยใช้องค์ประกอบผลตอบแทน

source: Go to comp round
th_th: ไปที่รอบการจ่ายผลตอบแทน

source: Rounds using comp elements
th_th: รอบการใช้องค์ประกอบผลตอบแทน

source: Create your first comp element
th_th: สร้างองค์ประกอบของผลตอบแทนแรกของคุณ

source: View and manage comp trees and comp elements
th_th: ดูและจัดการแผนภูมิผลตอบแทนและองค์ประกอบผลตอบแทน

source: Enable comp element
th_th: เปิดใช้งานองค์ประกอบของผลตอบแทน

source: Compensation element tree
th_th: แผนภูมิองค์ประกอบของผลตอบแทน

source: View comp element
th_th: ดูองค์ประกอบ comp

source: Compensation element
th_th: องค์ประกอบผลตอบแทน

source: Select the compensation element that will use this rule
th_th: เลือกองค์ประกอบผลตอบแทนที่จะใช้กฎนี้

source: The compensation element cannot be empty.
th_th: องค์ประกอบค่าตอบแทนต้องไม่เว้นว่าง

source: No target budget
th_th: ไม่มีงบประมาณเป้าหมาย

source: Outcome
th_th: ผลลัพธ์

source: Define the outcome of the rule
th_th: กำหนดผลลัพธ์ของกฎ

source: The rule list is empty. Get started by creating a budget rule.
th_th: รายการกฎว่างเปล่า เริ่มต้นด้วยการสร้างกฎงบประมาณ

source: Create rule
th_th: สร้างกฎ

source: How do you want to distribute your budget?
th_th: คุณต้องการกระจายงบประมาณของคุณอย่างไร

source: Budget rules
th_th: กฏงบประมาณ

source: Are you sure you want to delete this condition block?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบบล็อคเงื่อนไขนี้

source: Delete condition block
th_th: ลบบล็อคเงื่อนไข

source: The compensation round was successfully published.
th_th: เผยแพรรอบการชดเชยสำเร็จแล้ว

source: Are you sure you want to republish the compensation round?
th_th: คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่รอบการจ่ายผลตอบแทนอีกครั้ง

source: The compensation round was successfully republished.
th_th: รอบการจ่ายผลตอบแทนได้รับการเผยแพร่ใหม่สำเร็จแล้ว

source: Republish compensation round
th_th: เผยแพร่รอบการจ่ายผลตอบแทนอีกครั้ง

source: Your changes will be saved as a staged draft. The published version of the comp round will remain unchanged until it is republished. Are you sure you want to save as a staged draft?
th_th: การเปลี่ยนแปลงของคุณจะถูกบันทึกเป็นแบบร่างในแต่ละขั้นตอน เวอร์ชันที่เผยแพร่ของรอบการจ่ายผลตอบแทนจะยังคงไม่เปลี่ยนแปลงจนกว่าจะมีการเผยแพร่ซ้ำ คุณแน่ใจหรือไม่ว่าต้องการบันทึกเป็นแบบร่างในแต่ละขั้นตอน

source: Are you sure you want to update the compensation round?
th_th: คุณแน่ใจหรือไม่ว่าต้องการอัปเดตรอบการจ่ายผลตอบแทน

source: The compensation round was successfully updated.
th_th: อัปเดตรอบการจ่ายผลตอบแทนเรียบร้อยแล้ว

source: Update compensation round
th_th: อัปเดตรอบการจ่ายผลตอบแทน

source: Updates have been made to the selected data model. Please review and validate your round configurations. Last update: {{date}}
th_th: มีการอัปเดตโมเดลข้อมูลที่เลือกแล้ว โปรดตรวจสอบและยืนยันกากรกำหนดค่ารอบของคุณ อัปเดตล่าสุด: {{date}}

source: Generate validation report
th_th: สร้างรายงานการตรวจสอบความถูกต้อง

source: Changes detected in data model
th_th: ตรวจพบการเปลี่ยนแปลงในโมเดลข้อมูล

source: The pending draft was successfully deleted.
th_th: ลบฉบับร่างที่รอดำเนินการสำเร็จแล้ว

source: The compensation round was successfully deleted.
th_th: รอบผลตอบแทนถูกลบสำเร็จแล้ว

source: The compensation round was successfully duplicated.
th_th: รอบการชดเชยถูกทำสำเร็จในการทำสำเนาเรียบร้อยแล้ว

source: The compensation round was duplicated and a new item was created.
th_th: รอบผลตอบแทนซ้ำกันและมีการสร้างรายการใหม่

source: Select the comp element that will use this rule.
th_th: เลือกองค์ประกอบผลตอบแทนที่จะใช้กฎนี้

source: All individuals within the specified population are by default eligible. Create rules to exclude workers.
th_th: บุคคลทั้งหมดภายในกลุ่มประชากรที่ระบุจะมีสิทธิ์ตามค่าเริ่มต้น สร้างกฎเพื่อแยกพนักงานออก

source: Eligibility rules
th_th: กฎคุณสมบัติ

source: Expression
th_th: การแสดงออก

source: All individuals in the defined population are by default eligible. You can create and configure rules to exclude certain workers.
th_th: บุคคลทั้งหมดในประชากรที่กำหนดไว้จะมีสิทธิ์ตามค่าเริ่มต้น คุณสามารถสร้างและกำหนดค่ากฎเพื่อแยกพนักงานบางรายออก

source: Create rules to make workers ineligible.
th_th: สร้างกฎเพื่อยกเลิกคุณสมบัติของพนักงานบางส่วน

source: Rule name
th_th: ชื่อกฎ

source: The rule name cannot be empty.
th_th: ไม่สามารถเว้นว่างชื่อกฎได้

source: After
th_th: หลังจาก

source: Before
th_th: ก่อน

source: Contains
th_th: ประกอบด้วย

source: The operator is required
th_th: จำเป็นต้องระบุผู้ดำเนินการ

source: Greater than
th_th: มากกว่า

source: Greater than or equal to
th_th: มากกว่าหรือเท่ากับ

source: In
th_th: ใน

source: Checked
th_th: ตรวจสอบแล้ว

source: Equal to
th_th: เท่ากับ

source: Not checked
th_th: ไม่ได้ตรวจสอบ

source: Not empty
th_th: ไม่ว่าง

source: Not equal to
th_th: ไม่เท่ากับ

source: Less than
th_th: น้อยกว่า

source: Less than or equal to
th_th: น้อยกว่าหรือเท่ากับ

source: Doesn't contain
th_th: ไม่ประกอบด้วย

source: Not in
th_th: ไม่อยู่ใน

source: On or after
th_th: ในหรือหลัง

source: On or before
th_th: ในหรือก่อน

source: Range
th_th: ช่วง

source: Value
th_th: ค่า

source: The value is required.
th_th: จำเป็นต้องระบุค่า

source: Rule details
th_th: รายละเอียดกฎ

source: Enter a name and a description for the rule.
th_th: ป้อนชื่อและคำอธิบายสำหรับกฎ

source: Filter by comp element
th_th: กรองตามองค์ประกอบผลตอบแทน

source: One or more steps failed to process. Edit the pending draft, and then try to publish again.
th_th: มีขั้นตอนหนึ่งขั้นตอนหรือมากกว่าที่ประมวลผลไม่สำเร็จ แก้ไขแบบร่างที่รอดำเนินการแล้วลองเผยแพร่อีกครั้ง

source: One or more steps failed to process. Edit the round, and then try to publish again.
th_th: มีขั้นตอนหนึ่งขั้นตอนหรือมากกว่าที่ประมวลผลไม่สำเร็จ แก้ไขรอบการประเมินแล้วลองเผยแพร่อีกครั้ง

source: Comp manager
th_th: ผู้จัดการค่าตอบแทน

source: Comp manager + 1
th_th: ผู้จัดการค่าตอบแทน + 1

source: No actors are selected. If you continue, no one will have access to this round.
th_th: ยังไม่ได้เลือกผู้ใช้งาน หากคุณดำเนินการต่อ จะไม่มีใครสามารถเข้าถึงรอบนี้ได้

source: Select actors
th_th: เลือกนักแสดง

source: Selected actors
th_th: นักแสดงที่เลือก

source: Define which actors can access this round.
th_th: กำหนดว่าใครสามารถเข้าถึงรอบนี้ได้

source: Actors & round access
th_th: นักแสดงและการเข้าถึงแบบรอบด้าน

source: At least one actor must be selected.
th_th: ต้องเลือกนักแสดงอย่างน้อยหนึ่งคน

source: Modify the bonus calculation formula if needed.
th_th: ปรับเปลี่ยนสูตรการคำนวณโบนัสหากจำเป็น

source: Customize formula
th_th: ปรับแต่งสูตร

source: Reset formula
th_th: รีเซ็ตสูตร

source: Preview the bonus calculation formula
th_th: ดูตัวอย่างสูตรการคำนวณโบนัส

source: Bonus calculation formula
th_th: สูตรการคำนวณโบนัส

source: Currency source
th_th: แหล่งที่มาของสกุลเงิน

source: All currencies
th_th: ทุกสกุลเงิน

source: Any currency available for the company
th_th: สกุลเงินใด ๆ ที่มีให้ใช้สำหรับบริษัท

source: Comp round currency
th_th: สกุลเงินสำหรับรอบการชดเชย

source: Currency of the comp round
th_th: สกุลเงินของรอบการชดเชย

source: Data model
th_th: โมเดลข้อมูล

source: Currency of the exact compensation element
th_th: สกุลเงินขององค์ประกอบค่าตอบแทนที่แน่นอน

source: The currency source cannot be empty.
th_th: แหล่งที่มาของสกุลเงินต้องไม่เว้นว่าง

source: Target bonus currency field
th_th: ฟิลด์สกุลเงินโบนัสเป้าหมาย

source: The target bonus currency field cannot be empty.
th_th: ฟิลด์สกุลเงินของโบนัสเป้าหมายต้องไม่เว้นว่าง

source: Review the target bonus formula
th_th: ตรวจสอบสูตรโบนัสเป้าหมาย

source: This plan contains an error.
th_th: แผนนี้มีข้อผิดพลาด

source: Bonus plans
th_th: แผนโบนัส

source: Distribute your budget
th_th: กระจายงบประมาณของคุณ

source: Budget
th_th: งบประมาณ

source: Bulk options
th_th: ตัวเลือกจำนวนมาก

source: Only custom/calculated columns can be deleted.
th_th: สามารถลบได้เฉพาะคอลัมน์แบบกำหนดเอง/คอลัมน์คำนวณเท่านั้น

source: The columns were successfully deleted.
th_th: ลบคอลัมน์สำเร็จแล้ว

source: The columns were successfully disabled.
th_th: ปิดใช้งานคอลัมน์สำเร็จแล้ว

source: The columns were successfully enabled.
th_th: เปิดใช้คอลัมน์สำเร็จแล้ว

source: Calculated column configuration - Expression formula
th_th: การกำหนดค่าคอลัมน์คำนวณ - สูตรนิพจน์

source: Add criteria
th_th: เพิ่มเกณฑ์

source: Rule configuration
th_th: การกำหนดค่ากฎ

source: Add criteria blocks to configure the rule
th_th: เพิ่มบล็อกเกณฑ์เพื่อกำหนดค่ากฎ

source: Change type
th_th: เปลี่ยนประเภท

source: Changing the value type will clear the values you have entered. This action cannot be undone.
th_th: การเปลี่ยนประเภทของค่า จะลบค่าที่คุณได้กรอกไว้ การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Change value type
th_th: เปลี่ยนประเภทของค่า

source: Fixed
th_th: คงที่

source: Calculated field
th_th: ฟิลด์ที่คำนวณ

source: Calculation
th_th: การคำนวณ

source: The code can contain only letters, numbers, or "_", and must start with a letter.
th_th: รหัสสามารถประกอบด้วยเฉพาะตัวอักษร ตัวเลข หรือ "_" และต้องขึ้นต้นด้วยตัวอักษรเท่านั้น

source: The code is required.
th_th: จำเป็นต้องระบุรหัส

source: Pick a color to visually group or highlight this column in the grid.
th_th: เลือกสีเพื่อจัดกลุ่มหรือเน้นคอลัมน์นี้ในตารางให้เห็นได้ชัดเจน

source: Column details
th_th: รายละเอียดคอลัมน์

source: Column name
th_th: ชื่อคอลัมน์

source: The column name is required.
th_th: จำเป็นต้องระบุชื่อคอลัมน์

source: Enable currency
th_th: เปิดใช้งานสกุลเงิน

source: Currency field
th_th: ช่องสกุลเงิน

source: The currency field is required.
th_th: จำเป็นต้องกรอกช่องสกุลเงิน

source: Decimal precision controls how many digits are shown after the decimal separator for display purposes. All calculations use the full number.
th_th: การตั้งค่าความละเอียดทศนิยมจะควบคุมจำนวนหลักที่แสดงหลังจุดทศนิยมเพื่อการแสดงผลเท่านั้น การคำนวณทั้งหมดจะใช้ตัวเลขเต็มเสมอ

source: Define the number of digits to display after the decimal separator.
th_th: กำหนดจำนวนหลักที่จะแสดงหลังจุดทศนิยม

source: Formula
th_th: สูตร

source: The expression (Else section) contains {{count}} error.
th_th: นิพจน์ (ส่วน Else) มีข้อผิดพลาด {{count}} รายการ

source: The expression (Else section) contains {{count}} errors.
th_th: นิพจน์ (ส่วน Else) มีข้อผิดพลาด {{count}} รายการ

source: The condition {{position}} (If section) contains {{count}} error.
th_th: เงื่อนไข {{position}} (ส่วน If) มีข้อผิดพลาด {{count}} รายการ

source: The condition {{position}} (If section) contains {{count}} errors.
th_th: เงื่อนไข {{position}} (ถ้ามีส่วนนี้) มีข้อผิดพลาด {{count}} รายการ

source: The expression {{position}} (Then section) contains {{count}} error.
th_th: นิพจน์ {{position}} (ส่วน Then) มีข้อผิดพลาด {{count}} รายการ

source: The expression {{position}} (Then section) contains {{count}} errors.
th_th: นิพจน์ {{position}} (จากนั้นส่วน) มีข้อผิดพลาด {{count}} รายการ

source: Else
th_th: อื่นๆ

source: If
th_th: หาก

source: The formula contains {{count}} error.
th_th: สูตรมีข้อผิดพลาด {{count}} รายการ

source: The formula contains {{count}} errors.
th_th: สูตรมีข้อผิดพลาด {{count}} รายการ

source: Then
th_th: จากนั้น

source: Conditional
th_th: มีเงื่อนไข

source: Non-conditional
th_th: ไม่เป็นเงื่อนไข

source: Header color
th_th: สีส่วนหัว

source: Decimal precision
th_th: ความแม่นยำทศนิยม

source: Help tip
th_th: เคล็ดลับช่วยเหลือ

source: This is a calculated column. The outcome is based on a formula.
th_th: นี่คือคอลัมน์ที่คำนวณขึ้น ผลลัพธ์จะขึ้นอยู่กับสูตร

source: Calculation workspace
th_th: พื้นที่ทำงานการคำนวณ

source: Open calculation workspace
th_th: เปิดพื้นที่ทำงานสำหรับการคำนวณ

source: Select a color for the group
th_th: เลือกสีสำหรับกลุ่ม

source: The selected color will apply to the columns of the group.
th_th: สีที่เลือกจะใช้กับคอลัมน์ของกลุ่ม

source: Selected column group
th_th: กลุ่มคอลัมน์ที่เลือก

source: Configure column group
th_th: กำหนดค่ากลุ่มคอลัมน์

source: Bonus amount
th_th: จำนวนโบนัส

source: The Bonus amount display name cannot be empty.
th_th: ไม่สามารถเว้นว่างชื่อที่แสดงของจำนวนโบนัสได้

source: The calculated bonus display name cannot be empty.
th_th: ไม่สามารถปล่อยให้ชื่อที่แสดงของโบนัสที่คำนวณแล้วว่างเปล่าได้

source: Column color
th_th: สีคอลัมน์

source: Define when managers must add notes during proposals
th_th: กำหนดว่าผู้จัดการต้องเพิ่มบันทึกเมื่อใดระหว่างการเสนอข้อเสนอ

source: Please select one of the options.
th_th: โปรดเลือกหนึ่งในตัวเลือก

source: Optional
th_th: ไม่บังคับ

source: Managers can submit without adding a note.
th_th: ผู้จัดการสามารถส่งได้โดยไม่ต้องเพิ่มบันทึก

source: Always required
th_th: จำเป็นต้องมีเสมอ

source: A note is always required, regardless of the value.
th_th: จำเป็นต้องมีบันทึกเสมอ ไม่ว่าจะมีค่าเท่าใดก็ตาม

source: Required if outside the guidelines
th_th: จำเป็นหากอยู่นอกแนวทางที่กำหนด

source: A note is required if the value is outside the min/max guidelines.
th_th: จำเป็นต้องมีหมายเหตุหากค่าดังกล่าวอยู่นอกแนวทางขั้นต่ำ/สูงสุด

source: Required notes
th_th: บันทึกที่จำเป็น

source: Column title
th_th: ชื่อคอลัมน์

source: Decimal display precision
th_th: ความแม่นยำในการแสดงทศนิยม

source: The decimal precision controls the number of digits displayed after the decimal separator. All calculations are however performed using the full number.
th_th: ความแม่นยำของทศนิยมควบคุมจำนวนหลักที่แสดงหลังตัวคั่นทศนิยม อย่างไรก็ตาม การคำนวณทั้งหมดจะดำเนินการโดยใช้จำนวนเต็ม

source: Define the text to be displayed as a tooltip when hovering the element
th_th: กำหนดข้อความที่จะแสดงเป็นคำอธิบายเครื่องมือเมื่อวางเมาส์เหนือองค์ประกอบ

source: Enter a new name for the field
th_th: ป้อนชื่อใหม่สำหรับฟิลด์

source: Input field
th_th: ฟิลด์ป้อนข้อมูล

source: Guaranteed amount
th_th: จำนวนที่รับประกัน

source: The Guaranteed amount display name cannot be empty.
th_th: ชื่อที่แสดงของจำนวนเงินที่รับประกันต้องไม่เว้นว่าง

source: Increase amount
th_th: จำนวนการเพิ่ม

source: The Increase amount display name cannot be empty.
th_th: ไม่สามารถเว้นว่างชื่อที่แสดงของจำนวนการปรับเพิ่มได้

source: Increase %
th_th: เพิ่มขึ้น %

source: The Increase percent display name cannot be empty.
th_th: ไม่สามารถปล่อยให้ชื่อที่แสดงของเปอร์เซ็นต์การขึ้นเงินเดือนว่างเปล่าได้

source: New value
th_th: ค่าใหม่

source: Prorated target bonus
th_th: เป้าหมายโบนัสแบบคำนวณตามสัดส่วน

source: The Prorated target bonus display name cannot be empty.
th_th: ไม่สามารถเว้นว่างชื่อที่แสดงของโบนัสเป้าหมายแบบคิดตามสัดส่วนได้

source: Reference column
th_th: คอลัมน์อ้างอิง

source: Referenced fields
th_th: ฟิลด์ข้อมูลอ้างอิง

source: At least one of the following fields must be enabled: Target bonus, Prorated target bonus, Calculated bonus, Bonus amount, or Guaranteed amount.
th_th: ต้องเปิดใช้งานอย่างน้อยหนึ่งในฟิลด์ต่อไปนี้: โบนัสเป้าหมาย โบนัสเป้าหมายแบบคิดตามสัดส่วน โบนัสที่คำนวณแล้ว จำนวนโบนัส หรือ จำนวนที่รับประกัน

source: The New value display name cannot be empty.
th_th: ไม่สามารถเว้นชื่อการแสดงผลของค่าใหม่ให้ว่างได้

source: Selected column
th_th: คอลัมน์ที่เลือก

source: The Target bonus display name cannot be empty.
th_th: ไม่สามารถปล่อยว่างชื่อที่แสดงของโบนัสเป้าหมายได้

source: Configure column
th_th: กำหนดค่าคอลัมน์

source: No reference
th_th: ไม่มีการอ้างอิง

source: Select the field from the compensation history from which the calculations will be referenced.
th_th: เลือกฟิลด์จากประวัติผลตอบแทนที่การคำนวณจะอ้างอิงถึง

source: Reference field
th_th: ฟิลด์ข้อมูลอ้างอิง

source: Delete columns
th_th: ลบคอลัมน์

source: Are you sure you want to delete the selected columns?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบคอลัมน์ที่เลือกไว้?

source: Delete column
th_th: ลบคอลัมน์

source: Are you sure you want to delete the selected column?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบคอลัมน์ที่เลือก?

source: The column was successfully deleted.
th_th: ลบคอลัมน์เรียบร้อยแล้ว

source: Use the Team planner view to control which columns managers and HRBPs see in your compensation grid, rename and reorder them, group columns, create columns, set decimal precision, assign colors, and add tooltips.
th_th: ใช้มุมมอง Team planner เพื่อควบคุมว่าผู้จัดการและ HRBP จะเห็นคอลัมน์ใดในตารางค่าตอบแทนของคุณ เปลี่ยนชื่อและจัดลำดับใหม่ จัดกลุ่มคอลัมน์ สร้างคอลัมน์ กำหนดความละเอียดทศนิยม กำหนดสี และเพิ่มคำแนะนำเครื่องมือ
